{
    "questions": [
        {"q": "What is the name of the college?", "a": "Our college is Kumaraguru College of Technology, Coimbatore."},
        {"q": "College name?", "a": "We are Kumaraguru College of Technology, Coimbatore."},
        {"q": "Where is the college located?", "a": "The college is located in Saravanampatti,Coimbatore, Tamil Nadu."},
        {"q": "Location of college?", "a": "Kumaraguru College of Technology is in Saravanampatti,Coimbatore, Tamil Nadu."},
        {"q": "What courses do you offer?", "a": "We offer B.Tech, M.Tech, and MBA courses."},
        {"q": "Which programs are available?", "a": "We offer B.Tech, M.Tech, and MBA courses."},
        {"q": "What departments are available?", "a": "We have departments like CSE, ECE, Mechanical, Civil, MBA, and more."},
        {"q": "List all departments?", "a": "Departments include CSE, ECE, Mechanical, Civil, MBA, and others."},
        {"q": "Which branches can I choose?", "a": "You can choose from CSE, ECE, Mechanical, Civil, MBA, etc."},
        {"q": "How can I apply for admission?", "a": "You can apply online via our official website or submit a physical form at the admission office."},
        {"q": "When do admissions open?", "a": "Admissions usually open in June every year. Check the college website for exact dates."},
        {"q": "What is the last date for admission?", "a": "The last date is typically in July. Please check the official site for updates."},
        {"q": "What is the admission process?", "a": "Admissions are based on entrance exams and merit lists."},
        {"q": "Are there entrance exams?", "a": "Yes, some courses require national or college-level entrance exams."},
        {"q": "What are the college timings?", "a": "College timings are 9 AM to 5 PM from Monday to Friday."},
        {"q": "Do you provide hostel facilities?", "a": "Yes, we have separate hostels for boys and girls."},
        {"q": "Is hostel mandatory?", "a": "No, hostel is optional for students living nearby."},
        {"q": "Do you provide scholarships?", "a": "Yes, scholarships are available based on merit and financial need."},
        {"q": "Is there a placement cell?", "a": "Yes, we have a dedicated placement cell for internships and job placements."},
        {"q": "How are the placements?", "a": "Our placement record is excellent, with companies from IT, core, and management sectors hiring students."},
        {"q": "Can I contact the placement cell?", "a": "Yes, you can email placement@college.edu or visit the placement office."},
        {"q": "Do you have sports facilities?", "a": "Yes, we have playgrounds, indoor courts, and a gym for students."},
        {"q": "Do you have a library?", "a": "Yes, the library is well-stocked with books, journals, and e-resources."},
        {"q": "What is the library timing?", "a": "The library is open from 8 AM to 8 PM on weekdays."},
        {"q": "Is Wi-Fi available on campus?", "a": "Yes, campus-wide Wi-Fi is available for students and staff."},
        {"q": "Are labs available for students?", "a": "Yes, we have well-equipped labs for all technical courses."},
        {"q": "Do you provide transportation facilities?", "a": "Yes, college buses are available for nearby areas."},
        {"q": "Is there a medical facility on campus?", "a": "Yes, we have a medical center with a nurse and visiting doctor."},
        {"q": "Can I meet the faculty?", "a": "You can schedule a meeting via email or contact the department office."},
        {"q": "How can I contact the administration?", "a": "You can email admin@college.edu or call 1234567890."},
        {"q": "Administration email?", "a": "You can email the administration at admin@college.edu."},
        {"q": "Administration phone number?", "a": "You can contact the administration at 1234567890."},
        {"q": "Is online application available?", "a": "Yes, you can apply online through our official college website."},
        {"q": "What is the fee structure?", "a": "Fees vary by course. Detailed fee structure is available on the website."},
        {"q": "Are there hostel fees?", "a": "Yes, hostel fees are separate and depend on room type and facilities."},
        {"q": "Do you offer financial aid?", "a": "Yes, financial aid is available based on merit and need."},
        {"q": "Are there cultural events?", "a": "Yes, we host annual cultural festivals, competitions, and workshops."},
        {"q": "Is there a cafeteria?", "a": "Yes, we have a cafeteria offering meals, snacks, and beverages."},
        {"q": "Do you have a student council?", "a": "Yes, students can participate in the student council and other committees."},
        {"q": "Are there counseling services?", "a": "Yes, we provide career and psychological counseling services."},
        {"q": "What is the academic calendar?", "a": "The academic year runs from June to May, divided into two semesters."},
        {"q": "Is attendance mandatory?", "a": "Yes, a minimum of 75% attendance is required to appear for exams."},
        {"q": "Do you have an alumni network?", "a": "Yes, we have an active alumni association for networking and mentorship."},
        {"q": "Can parents visit the campus?", "a": "Yes, campus visits are allowed during official hours."},
        {"q": "Is the campus safe?", "a": "Yes, we have 24/7 security and CCTV surveillance on campus."},
        {"q": "Are there workshops and seminars?", "a": "Yes, regular workshops and seminars are conducted for students."},
        {"q": "Can students participate in competitions?", "a": "Yes, students are encouraged to participate in national and international competitions."},
        {"q": "Do you provide hostel Wi-Fi?", "a": "Yes, Wi-Fi is available in hostels."},
        {"q": "Is there a dress code?", "a": "No strict dress code, but students are expected to dress appropriately."},
        {"q": "Can I switch courses?", "a": "Course change requests are handled as per college policy, usually in the first semester."},
        {"q": "Do you provide lab safety training?", "a": "Yes, all students undergo lab safety training at the start of each semester."},
        {"q": "Are there mentorship programs?", "a": "Yes, each student is assigned a faculty mentor for guidance."},
        {"q": "Can I do internships during studies?", "a": "Yes, internships are encouraged and facilitated by the placement cell."},
        {"q": "Are international students allowed?", "a": "Yes, international students are welcome with separate hostel facilities."},
        {"q": "Do you have research programs?", "a": "Yes, students can participate in faculty-led research projects."},
        {"q": "Can students participate in tech competitions?", "a": "Yes, students are encouraged to participate in hackathons, coding competitions, and robotics contests."},
        {"q": "Is there a grievance cell?", "a": "Yes, students can approach the grievance cell for any issues."},
        {"q": "What is the college vision?", "a": "Our vision is to provide quality technical education and foster innovation."},
        {"q": "What is the college mission?", "a": "Our mission is to nurture students into skilled professionals and responsible citizens."},
        {"q": "Are exams conducted online?", "a": "Some internal tests may be online, but major semester exams are on campus."},
        {"q": "Are there academic clubs?", "a": "Yes, we have coding, robotics, AI, and electronics clubs for academic growth."},
        {"q": "Do you conduct orientation programs?", "a": "Yes, all new students attend an orientation at the start of the academic year."},
        {"q": "Are extracurricular certificates provided?", "a": "Yes, certificates are given for participation in events, workshops, and competitions."},
        {"q": "Is there a grievance redressal for hostel?", "a": "Yes, hostel grievances can be submitted to the warden or hostel office."},
        {"q": "Are there cultural clubs?", "a": "Yes, we have music, dance, drama, and photography clubs."},
        {"q": "Do you have annual day celebrations?", "a": "Yes, annual day is celebrated with performances, awards, and cultural events."},
        {"q": "Are medical checkups mandatory?", "a": "Yes, all students undergo a basic medical checkup at the start of the year."},
        {"q": "Are workshops conducted by external experts?", "a": "Yes, workshops are often conducted by industry experts and professors."},
        {"q": "Do you provide career guidance?", "a": "Yes, the career guidance cell assists students in choosing paths and preparing for placements."},
        {"q": "Can I know faculty names?", "a": "Yes, faculty details are available on the college website or department office."},
        {"q": "Is there a student handbook?", "a": "Yes, a handbook with rules, policies, and contacts is provided to all students."},
        {"q": "Do you provide transportation for events?", "a": "Yes, transport is arranged for official events, excursions, and competitions."}
    ]
}
